snlkuharlocal/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <attributes>
    <name>ДопИнфо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/РабочиеМеста/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТекущееРабочееМесто(Знач ИмяКомпьютера) Экспорт
	Результат = Справочники.РабочиеМеста.ПустаяСсылка();	
	
	ИмяКомпьютера = НРег(ИмяКомпьютера);
	
	Если ЗначениеЗаполнено(ИмяКомпьютера) Тогда	
		
		РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду(ИмяКомпьютера);
		
		Если ЗначениеЗаполнено(РабочееМесто)  Тогда
			Результат = РабочееМесто;
		Иначе
			СпрОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();	
			
			СпрОбъект.Код 			= ИмяКомпьютера;
			СпрОбъект.Наименование	= ИмяКомпьютера;
			
			СпрОбъект.Записать();
			
			Результат = СпрОбъект.Ссылка;
		КонецЕсли;	
	КонецЕсли;                           
	
	Возврат Результат;
КонецФункции //ПолучитьТекущееРабочееМесто() Экспорт

Функция ПолучитьРабочееМестоПоУзлу(УзелТерминала) Экспорт
	Результат = Справочники.РабочиеМеста.ПустаяСсылка();	
	
	Если ЗначениеЗаполнено(УзелТерминала) Тогда	
		ИмяКомпьютера = СокрЛП(ПолучитьРеквизитШапки(УзелТерминала, "Код"));
		
		РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду(ИмяКомпьютера);
		
		Если ЗначениеЗаполнено(РабочееМесто)  Тогда
			Результат = РабочееМесто;
		Иначе
			СпрОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();	
			
			СпрОбъект.Код 			= ИмяКомпьютера;
			СпрОбъект.Наименование	= ИмяКомпьютера;
			
			СпрОбъект.ЭтоТСД 		= Истина;
			СпрОбъект.ИмяПланаОбмена= УзелТерминала.Метаданные().Имя;
			
			СпрОбъект.Записать();
			
			Результат = СпрОбъект.Ссылка;
		КонецЕсли;	
	КонецЕсли;                           
	
	Возврат Результат;
КонецФункции //ПолучитьТекущееРабочееМесто() Экспорт


#КонецЕсли
